public/reading/blogs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="reading.html">Reading</a> &gt;
</p>

<div id="outline-container-orga1b61d0" class="outline-2">
<h2 id="orga1b61d0">Blogs</h2>
<div class="outline-text-2" id="text-orga1b61d0">
<p>
It is really hard do find <b>good</b> blogs, especially the ones I like. Here
is a curated list of my favorite blogs:
</p>

<ul class="org-ul">
<li><b><a href="https://protesilaos.com/feeds/">Protesilaos Stavrou</a></b>: Prot is a well known member of the emacs
community, he is also a very unique person. He lives alone in a poor
area in the mountains, with just a few hours of electricity if there
is sun, and maintains various emacs packages. He has an education in
philosophy and a youtube channel where he mainly talks about emacs,
philosophy and him building his modest house. There is really a lot
to learn from a person like him.</li>
<li><b><a href="https://sachachua.com/blog/feed/index.html">Sacha chua</a></b>: Very frequent writer and another famous face in the
emacs community. I read her posts basically everyday, lots of
interesting stuff especially if you are interested in emacs and
random trivias about packages.</li>
<li><b><a href="https://blogsystem5.substack.com/feed">Julio Merino</a></b>: I found him on hackernews and It really fitted my
interests. The guy talks about low level programming / hardware and
he is very knowledgeable about it, one of the true OGs. I find all
of his blogs really interesting and with an old school feel.</li>
<li><b><a href="https://www.antirez.com/rss">Salvatore Sanfilippo</a></b>: Finally some Italian here! Salvatore is an
exceptional programmer and the founder of <a href="https://github.com/redis/redis">Redis</a>. He is always very
interesting to listen to, he has a youtube channel and often has
strong opinions about software and work life, which I admire.</li>
<li><b><a href="https://lwn.net/">LWN</a></b> : The main medium for talking about the linux kernel other
than the mailing lists, LWN is a very important website in the
history and development of the linux community.</li>
<li><b><a href="https://eli.thegreenplace.net/feeds/all.atom.xml">Eli Bendersky</a></b>: Very interesting, he often delves into math which I
really enjoy.</li>
<li><b><a href="https://www.phoronix.com/rss.php">Phoronix</a></b>: The best news site for linux kernel related things,
after LWN. I noticed that whenever I was looking for benchmarks, the
best were always from a certain Michael Larabel, so I dig deeper and
discovered his website and his <a href="https://github.com/phoronix-test-suite/phoronix-test-suite">software</a> to do benchmarking, which is
totally awesome.</li>
<li><b><a href="https://www.brendangregg.com/blog/rss.xml">Brendan Gregg</a></b>: Very competent programmer focusing on performance
evaluation. He created the <a href="https://github.com/brendangregg/FlameGraph">flamegraph</a> tool.</li>
<li><b><a href="https://blog.vaxry.net/feed">Vaxry</a></b>: This is the blog of the creator of <a href="https://github.com/hyprwm/Hyprland">Hyprland</a>. Even if I
don't use hyprland anymore, he is a true gigachad and most of the
development of Hyprland was carried by him alone.</li>
<li><b><a href="https://arxiv.org/">Arxiv</a></b>: This isn't really a blog, but Its a scientific publications
website. I am subscribed to some subjects and I regularly read
It. It's my main source of catching up with the state of the art.</li>
</ul>

<p>
And many many more, those are only a few honorable mentions. I will
try to keep this list up to date.
</p>

<p>
To <b>discover blogs</b>, what I usually do is:
</p>
<ul class="org-ul">
<li>browse <a href="https://news.ycombinator.com/">hackernews</a> daily</li>
<li>stalker people in mailing lists / open source projects that I follow</li>
<li>look at <a href="https://indieblog.page/all">indieblog</a> sometimes</li>
<li>in general, be curious about the people behind the code, and assume
that every decent programmer has a blog</li>
</ul>
<p>
I use <a href="https://www.gnus.org/">gnus</a> as my <b>feeds aggregator</b>.
</p>

<hr />

<p>
Travel: <a href="reading.html">Reading</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
